// Дана последовательность температурных колебаний: -25.4, -27.0 13.0, 19.0, 15.5, 24.5, -21.0, 32.5.
// Объединить данные значения в группы с шагом в 10 градусов. Последовательность в подмножноствах не важна.

// Пример: -20:{-25.0, -27.0, -21.0}, 10:{13.0, 19.0, 15.5}, 20: {24.5}, etc.

package main

import (
	"fmt"
)

func main() {
	var S int = 10
	T := []float64{-39.4, -25.4, -27.0, 13.0, 19.0, 15.5, 24.5, -21.0, 32.5}
	resultT := make(map[int][]float64)

	for _, v := range T {
		k := int(v) / S * S
		resultT[k] = append(resultT[k], v)
	}

	fmt.Println(resultT)
}
